plcexpert/plc-x-arduino-hardware/avr/boards.txt
## -------------------- PRODUCTS --------------------

## DIO - Digital Input/Ouput Arduino UNO shield
## -------------------------------------------------
PLCAVR.menu.module.DIO13=PlcX-DIO 1.3 (Arduino UNO)

PLCAVR.menu.module.DIO13.bootloader.high_fuses=0xDE
PLCAVR.menu.module.DIO13.bootloader.low_fuses=0xFF
PLCAVR.menu.module.DIO13.bootloader.extended_fuses=0xFD
PLCAVR.menu.module.DIO13.bootloader.unlock_bits=0xFF
PLCAVR.menu.module.DIO13.bootloader.lock_bits=0x0F
PLCAVR.menu.module.DIO13.bootloader.file=optiboot_atmega328.hex

PLCAVR.menu.module.DIO13.build.mcu=atmega328p
PLCAVR.menu.module.DIO13.build.f_cpu=16000000L
PLCAVR.menu.module.DIO13.build.variant=atmega328p
PLCAVR.menu.module.DIO13.build.board=AVR_UNO

PLCAVR.menu.module.DIO13.upload.maximum_size=32256
PLCAVR.menu.module.DIO13.upload.maximum_data_size=2048
PLCAVR.menu.module.DIO13.upload.speed=115200

## DIO - Digital Input/Ouput Arduino NANO shield 
## -------------------------------------------------
PLCAVR.menu.module.DIO14=PlcX-DIO 1.4 (Arduino NANO)

PLCAVR.menu.module.DIO14.bootloader.high_fuses=0xDE
PLCAVR.menu.module.DIO14.bootloader.low_fuses=0xFF
PLCAVR.menu.module.DIO14.bootloader.extended_fuses=0xFD
PLCAVR.menu.module.DIO14.bootloader.unlock_bits=0xFF
PLCAVR.menu.module.DIO14.bootloader.lock_bits=0x0F
PLCAVR.menu.module.DIO14.bootloader.file=optiboot_atmega328.hex

PLCAVR.menu.module.DIO14.build.mcu=atmega328p
PLCAVR.menu.module.DIO14.build.f_cpu=16000000L
PLCAVR.menu.module.DIO14.build.variant=atmega328p
PLCAVR.menu.module.DIO14.build.board=AVR_UNO

PLCAVR.menu.module.DIO14.upload.maximum_size=32256
PLCAVR.menu.module.DIO14.upload.maximum_data_size=2048
PLCAVR.menu.module.DIO14.upload.speed=115200

## DIO - Digital Input/Ouput Arduino NANO shield, source version Arduino MegaAVR 1.8.7
## -------------------------------------------------
PLCAVR.menu.module.DIO14NE=PlcX-DIO 1.4 (Arduino NANO EVERY)

PLCAVR.menu.module.DIO14NE.vid.0=0x2341
PLCAVR.menu.module.DIO14NE.pid.0=0x0058

PLCAVR.menu.module.DIO14NE.bootloader.tool=avrdude
PLCAVR.menu.module.DIO14NE.bootloader.file=atmega4809_uart_bl.hex
PLCAVR.menu.module.DIO14NE.bootloader.SYSCFG0=0xC9
PLCAVR.menu.module.DIO14NE.bootloader.BOOTEND=0x00
PLCAVR.menu.module.DIO14NE.bootloader.OSCCFG=0x01
PLCAVR.menu.module.DIO14NE.fuses.file=fuses_4809.bin

PLCAVR.menu.module.DIO14NE.build.mcu=atmega4809
PLCAVR.menu.module.DIO14NE.build.f_cpu=16000000L
PLCAVR.menu.module.DIO14NE.build.board=AVR_NANO_EVERY
PLCAVR.menu.module.DIO14NE.build.core=nanoevery
PLCAVR.menu.module.DIO14NE.build.variant=nona4809
PLCAVR.menu.module.DIO14NE.build.text_section_start=.text=0x0
PLCAVR.menu.module.DIO14NE.build.extra_flags= -DMILLIS_USE_TIMERB3 -DNO_EXTERNAL_I2C_PULLUP

PLCAVR.menu.module.DIO14NE.upload.tool=avrdude
PLCAVR.menu.module.DIO14NE.upload.maximum_size=49152
PLCAVR.menu.module.DIO14NE.upload.maximum_data_size=6144
PLCAVR.menu.module.DIO14NE.upload.speed=115200
PLCAVR.menu.module.DIO14NE.upload.protocol=jtag2updi
PLCAVR.menu.module.DIO14NE.upload.use_1200bps_touch=true
PLCAVR.menu.module.DIO14NE.upload.extra_params=-P{serial.port}

## PlcX-Micro 1.3
## -------------------------------------------------
PLCAVR.menu.module.MICRO13=PlcX-Micro 1.3

PLCAVR.menu.module.MICRO13.bootloader.high_fuses=0xDE
PLCAVR.menu.module.MICRO13.bootloader.low_fuses=0xFF
PLCAVR.menu.module.MICRO13.bootloader.extended_fuses=0xFD
PLCAVR.menu.module.MICRO13.bootloader.unlock_bits=0xFF
PLCAVR.menu.module.MICRO13.bootloader.lock_bits=0x0F
PLCAVR.menu.module.MICRO13.bootloader.file=optiboot_m328pb.hex

PLCAVR.menu.module.MICRO13.build.mcu=atmega328pb
PLCAVR.menu.module.MICRO13.build.f_cpu=16000000L
PLCAVR.menu.module.MICRO13.build.variant=atmega328pb
PLCAVR.menu.module.MICRO13.build.board=AVR_UNO

PLCAVR.menu.module.MICRO13.upload.maximum_size=32256
PLCAVR.menu.module.MICRO13.upload.maximum_data_size=2048
PLCAVR.menu.module.MICRO13.upload.speed=115200

## PlcX-Nano 1.0
## -------------------------------------------------
PLCAVR.menu.module.NANO10=PlcX-Nano 1.0

PLCAVR.menu.module.NANO10.bootloader.high_fuses=0xDE
PLCAVR.menu.module.NANO10.bootloader.low_fuses=0xFF
PLCAVR.menu.module.NANO10.bootloader.extended_fuses=0xFD
PLCAVR.menu.module.NANO10.bootloader.unlock_bits=0xFF
PLCAVR.menu.module.NANO10.bootloader.lock_bits=0x0F
PLCAVR.menu.module.NANO10.bootloader.file=optiboot_m328pb.hex

PLCAVR.menu.module.NANO10.build.mcu=atmega328pb
PLCAVR.menu.module.NANO10.build.f_cpu=20000000L
PLCAVR.menu.module.NANO10.build.variant=atmega328pb
PLCAVR.menu.module.NANO10.build.board=AVR_UNO

PLCAVR.menu.module.NANO10.upload.maximum_size=32256
PLCAVR.menu.module.NANO10.upload.maximum_data_size=2048
PLCAVR.menu.module.NANO10.upload.speed=115200

## RFID Reader
## -------------------------------------------------
PLCAVR.menu.module.RFID= PlcX-RFID Reader 1.0

PLCAVR.menu.module.RFID.bootloader.high_fuses=0xDF
PLCAVR.menu.module.RFID.bootloader.low_fuses=0xF1
PLCAVR.menu.module.RFID.bootloader.extended_fuses=0xFF
PLCAVR.menu.module.RFID.bootloader.unlock_bits=0xFF
PLCAVR.menu.module.RFID.bootloader.lock_bits=0xFF
PLCAVR.menu.module.RFID.bootloader.file=attiny85.hex
PLCAVR.menu.module.RFID.bootloader.tool=arduino:avrdude

PLCAVR.menu.module.RFID.build.core=arduino:arduino
PLCAVR.menu.module.RFID.build.mcu=attiny85
PLCAVR.menu.module.RFID.build.f_cpu=16000000L
PLCAVR.menu.module.RFID.build.variant=tiny85
PLCAVR.menu.module.RFID.build.board=attiny

PLCAVR.menu.module.RFID.upload.maximum_size=8192
PLCAVR.menu.module.RFID.upload.maximum_data_size=512

## UK - universal kit
## -------------------------------------------------
PLCAVR.menu.module.UK=PlcX-UK 1.4

PLCAVR.menu.module.UK.bootloader.high_fuses=0xDE
PLCAVR.menu.module.UK.bootloader.low_fuses=0xFF
PLCAVR.menu.module.UK.bootloader.extended_fuses=0xFD
PLCAVR.menu.module.UK.bootloader.unlock_bits=0xFF
PLCAVR.menu.module.UK.bootloader.lock_bits=0x0F
PLCAVR.menu.module.UK.bootloader.file=optiboot_atmega328.hex

PLCAVR.menu.module.UK.build.mcu=atmega328p
PLCAVR.menu.module.UK.build.f_cpu=16000000L
PLCAVR.menu.module.UK.build.variant=atmega328p
PLCAVR.menu.module.UK.build.board=AVR_UNO

PLCAVR.menu.module.UK.upload.maximum_size=32256
PLCAVR.menu.module.UK.upload.maximum_data_size=2048
PLCAVR.menu.module.UK.upload.speed=115200

