plcexpert/plc-x-arduino-hardware/avr/boards.txt
## --------------------------- CUSTOMER PRODUCTS ---------------------

## AccSens
## -------------------------------------------------
PLCAVRCUSTOMER.menu.module.X_ACCSENS=X-AccSens 1.0

PLCAVRCUSTOMER.menu.module.X_ACCSENS.bootloader.high_fuses=0xDE
PLCAVRCUSTOMER.menu.module.X_ACCSENS.bootloader.low_fuses=0xFF
PLCAVRCUSTOMER.menu.module.X_ACCSENS.bootloader.extended_fuses=0xFD
PLCAVRCUSTOMER.menu.module.X_ACCSENS.bootloader.unlock_bits=0xFF
PLCAVRCUSTOMER.menu.module.X_ACCSENS.bootloader.lock_bits=0x0F
PLCAVRCUSTOMER.menu.module.X_ACCSENS.bootloader.file=optiboot_m328pb.hex

PLCAVRCUSTOMER.menu.module.X_ACCSENS.build.mcu=ATmega328PB
PLCAVRCUSTOMER.menu.module.X_ACCSENS.build.f_cpu=16000000L
PLCAVRCUSTOMER.menu.module.X_ACCSENS.build.variant=atmega328pb
PLCAVRCUSTOMER.menu.module.X_ACCSENS.build.board=AVR_UNO

PLCAVRCUSTOMER.menu.module.X_ACCSENS.upload.maximum_size=32256
PLCAVRCUSTOMER.menu.module.X_ACCSENS.upload.maximum_data_size=2048
PLCAVRCUSTOMER.menu.module.X_ACCSENS.upload.speed=57600

## LCD terminal 1.0
## -------------------------------------------------
PLCAVRCUSTOMER.menu.module.X_LCDTERMINAL=X-LCD TERMINAL

PLCAVRCUSTOMER.menu.module.X_LCDTERMINAL.bootloader.tool=avrdude
PLCAVRCUSTOMER.menu.module.X_LCDTERMINAL.bootloader.low_fuses=0xFF
PLCAVRCUSTOMER.menu.module.X_LCDTERMINAL.bootloader.unlock_bits=0x3F
PLCAVRCUSTOMER.menu.module.X_LCDTERMINAL.bootloader.lock_bits=0x0F
PLCAVRCUSTOMER.menu.module.X_LCDTERMINAL.bootloader.high_fuses=0xD8
PLCAVRCUSTOMER.menu.module.X_LCDTERMINAL.bootloader.extended_fuses=0xFD
PLCAVRCUSTOMER.menu.module.X_LCDTERMINAL.bootloader.file=stk500boot_v2_mega2560.hex

PLCAVRCUSTOMER.menu.module.X_LCDTERMINAL.build.f_cpu=16000000L
PLCAVRCUSTOMER.menu.module.X_LCDTERMINAL.build.core=arduino
PLCAVRCUSTOMER.menu.module.X_LCDTERMINAL.build.variant=mega
PLCAVRCUSTOMER.menu.module.X_LCDTERMINAL.build.board=AVR_MEGA2560
PLCAVRCUSTOMER.menu.module.X_LCDTERMINAL.build.mcu=atmega2560
PLCAVRCUSTOMER.menu.module.X_LCDTERMINAL.upload.maximum_data_size=8192
PLCAVRCUSTOMER.menu.module.X_LCDTERMINAL.upload.protocol=wiring
PLCAVRCUSTOMER.menu.module.X_LCDTERMINAL.upload.maximum_size=253952
PLCAVRCUSTOMER.menu.module.X_LCDTERMINAL.upload.speed=115200

PLCAVRCUSTOMER.menu.module.X_LCDTERMINAL.vid.0=0x2341
PLCAVRCUSTOMER.menu.module.X_LCDTERMINAL.pid.0=0x0010
PLCAVRCUSTOMER.menu.module.X_LCDTERMINAL.vid.1=0x2341
PLCAVRCUSTOMER.menu.module.X_LCDTERMINAL.pid.1=0x0042
PLCAVRCUSTOMER.menu.module.X_LCDTERMINAL.vid.2=0x2A03
PLCAVRCUSTOMER.menu.module.X_LCDTERMINAL.pid.2=0x0010
PLCAVRCUSTOMER.menu.module.X_LCDTERMINAL.vid.3=0x2A03
PLCAVRCUSTOMER.menu.module.X_LCDTERMINAL.pid.3=0x0042
PLCAVRCUSTOMER.menu.module.X_LCDTERMINAL.vid.4=0x2341
PLCAVRCUSTOMER.menu.module.X_LCDTERMINAL.pid.4=0x0210
PLCAVRCUSTOMER.menu.module.X_LCDTERMINAL.vid.5=0x2341
PLCAVRCUSTOMER.menu.module.X_LCDTERMINAL.pid.5=0x0242

###################   ATMEL AVR (END)  ##############################